app/views/users/index.html.erb

  <h1><%= current_user.username %>'s Profile Page</h1>
  <% if current_user.orders.empty?  %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
SELECT  1 AS one FROM "orders" WHERE "orders"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

    <% end %>
    <% current_user.orders.each do |attending| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]