app/views/users/index.html.erb

  <h1><%= current_user.username %>'s Profile Page</h1>
  <% if current_user.attendings.empty?  %>
---
SELECT "attendings".* FROM "attendings" WHERE "attendings"."user_id" = $1  [["user_id", 1]]
SELECT  1 AS one FROM "attendings" WHERE "attendings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

    <% end %>
    <% current_user.attendings.each do |attending| %>
---
SELECT "attendings".* FROM "attendings" WHERE "attendings"."user_id" = $1  [["user_id", 1]]