app/controllers/attendings_controller.rb

  def index
    @movies = Movie.all.order('created_at ASC')
---
SELECT "movies".* FROM "movies" ORDER BY created_at ASC