app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY created_at DESC
---
   def index
      @movies = Movie.all.order('created_at DESC')