app/controllers/users_controller.rb

  def create
    @user = User.new(secure_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"